HRMREDChuklinTest.ZUPC/src/InformationRegisters/ZUPC_НовыеCотрудники/ZUPC_НовыеCотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ZUPC_НовыеCотрудники</name>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ActualDepartmentName</name>
    <type>
      <types>CatalogRef.ZUPC_ActualDepartmentName</types>
    </type>
  </resources>
  <resources>
    <name>ActualPositionTitle</name>
    <type>
      <types>CatalogRef.ZUPC_ActualPositionTitle</types>
    </type>
  </resources>
  <resources>
    <name>Desk_Team</name>
    <type>
      <types>CatalogRef.ZUPC_Desk_Team</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ОкладNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ОкладИзОффера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодовойБонусИзОффера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Юр_Лицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоходАгенства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Агенство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.ZUPC_Офисы</types>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>CatalogRef.ZUPC_НомерМеста</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизоватьРабочееМесто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СоздатьАккаунт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.ZUPC_Пропуски</types>
    </type>
  </resources>
  <resources>
    <name>МобильныйТелефон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийДляИТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеСогл</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перевод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Увольнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаВыхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдаленнаяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Город</name>
    <type>
      <types>CatalogRef.ZUPC_Locations</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтменаУвольнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Спеллинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FirstName</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>LastName</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UserLogonName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнойВводИмени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DateJoingGroup</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаПослеИспСрока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерез6Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерезГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерез9Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ZUPC_RemoteWorkLocation</name>
    <type>
      <types>CatalogRef.ZUPC_RemoteWorkLocation</types>
    </type>
  </resources>
  <resources>
    <name>Декрет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПовторныйНайм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SearchSource</name>
    <type>
      <types>EnumRef.ZUPC_SearchSource</types>
    </type>
  </resources>
  <resources>
    <name>Referree</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>AgencyName</name>
    <type>
      <types>CatalogRef.ZUPC_Agency</types>
    </type>
  </resources>
  <resources>
    <name>AgentFee</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СозданОбработкойНачальногоЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>СотрудникСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>201</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/InformationRegisters/ZUPC_УчетнаяИнформацияПользователей/ZUPC_УчетнаяИнформацияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ZUPC_УчетнаяИнформацияПользователей</name>
  <resources>
    <name>UserLogonName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Домен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоменПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Спеллинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FirstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>LastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>id_sd</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнойТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелефонДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВнутрНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ActiveEmployee</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновленияДляSD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>201</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СотрудникСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>201</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/Enums/ZUPC_SearchSource/ZUPC_SearchSource.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ZUPC_SearchSource</name>
  <enumValues>
    <name>DirectSearch</name>
  </enumValues>
  <enumValues>
    <name>Rehiring</name>
  </enumValues>
  <enumValues>
    <name>Referral</name>
  </enumValues>
  <enumValues>
    <name>Agency</name>
  </enumValues>
</mdclass:Enum>

HRMREDChuklinTest.ZUPC/src/InformationRegisters/ZUPC_НовыеCотрудники/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ДлиннаUserLogonName.Заголовок = "Длинна user logon name " + СтрДлина(Запись.UserLogonName) + " символов";	
	
	Рез = ПроверитьОтправкуСообщения(Запись.СотрудникСтрока);
	Если Рез Тогда
		Элементы.ДекорацияОтправлено.Подсказка = "Отправлено";
		Элементы.ДекорацияОтправлено.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)   
	
	Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	ОчиститьПоляАгентскойПрограммы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Запись.UserLogonName) Тогда
		Возврат;
	КонецЕсли;
	
	ДоменПочты      = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("ДоменПочты", Истина)[0];
	Домен      = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Домен", Истина)[0];
	UserLogonName   = Запись.UserLogonName;
	Почта           = Запись.ЭлектроннаяПочта;
	СотрудникСтрока = Запись.СотрудникСтрока;
	Спеллинг        = Запись.Спеллинг;
	ФизЛицо         = Запись.ФизическоеЛицо;
	УИДН            = Запись.УникальныйИдентификатор;
	
	Если Запись.Увольнение Или Запись.ОтменаВыхода Тогда
		
		ОбновитьСтатусПользователяВРегистре(Почта, СотрудникСтрока, УИДН, ФизЛицо, Истина);
		
	ИначеЕсли Запись.ОтменаУвольнения Тогда
		
		ОбновитьСтатусПользователяВРегистре(Почта, СотрудникСтрока, УИДН, ФизЛицо, Ложь);
		
	ИначеЕсли Запись.ПовторныйНайм Тогда
		// резервная логика для повторного найма — реализовать при необходимости
		
	Иначе
		
		МЗ =   РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
			
			МЗ.Почта =  Почта;
			МЗ.СотрудникСтрока = СотрудникСтрока;
			МЗ.Прочитать(); 
			
			МЗ.Почта =  Почта;
			МЗ.СотрудникСтрока = СотрудникСтрока;
			МЗ.UserLogonName = UserLogonName;
			МЗ.Домен 		 = Домен;
			МЗ.ДоменПочты 	 = ДоменПочты;
			МЗ.Спеллинг 	 = Спеллинг;
			МЗ.FirstName 	 = Запись.FirstName;
			МЗ.LastName 	 = Запись.LastName;
			МЗ.УникальныйИдентификатор =  УИДН;	
			МЗ.Отключить = Ложь;   
			Если ЗначениеЗаполнено(ФизЛицо) Тогда
				МЗ.ФизическоеЛицо = ФизЛицо;	
			КонецЕсли;

			МЗ.Записать();;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьПолейАгентскойПрограммы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура SearchSourceПриИзменении(Элемент)
	УстановитьВидимостьПолейАгентскойПрограммы();
КонецПроцедуры
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ОтправитьвИТ(Команда)
	//ОтправитьвИТНаСервере();
	ОтправитьвИТHTMLНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьвИТHTML(Команда)
	ОтправитьвИТHTMLНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьОтправкуСообщения(СотрудникСтрока)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыполненныеРассылки.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.RSN_ВыполненныеРассылки КАК ВыполненныеРассылки
	|ГДЕ
	|	ВыполненныеРассылки.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", СотрудникСтрока);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ЗаписатьЗавершениеУведомления(Сотрудник, Письмо)
	
	КонстантаРассылки = Справочники.ДополнительныеКонстанты.НайтиПоКоду("000000001");
	
	ВыпРас = РегистрыСведений.RSN_ВыполненныеРассылки.СоздатьМенеджерЗаписи();
	ВыпРас.Объект   = Сотрудник;
	ВыпРас.Рассылка = КонстантаРассылки;
	ВыпРас.Прочитать();
	
	Если Не ВыпРас.Выбран() Тогда
		ВыпРас.Объект                      = Сотрудник;
		ВыпРас.Рассылка                    = КонстантаРассылки;
		Если ЗначениеЗаполнено(Письмо) Тогда
			ВыпРас.ЭлектронноеПисьмоИсходящее = СтрШаблон("%1 № %2", Строка(Письмо), Письмо.Номер);
		КонецЕсли;
		ВыпРас.ДатаСоздания                = ТекущаяДатаСеанса();
		ВыпРас.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьвИТHTMLНаСервере()
	
	Контур = RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Контур", Истина)[0];

	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");  
	
	Офис       =  Запись.Офис;
	Офис 	   =  ?(ЗначениеЗаполнено(Офис),Офис, "Нет");
	НомерМеста = Запись.НомерМеста;
	НомерМеста = ?(ЗначениеЗаполнено(НомерМеста),НомерМеста,"Нет");       
	ДатаВыхода = Формат(Запись.ДатаВыхода , "ДФ=dd.MM.yyyy");
	ДатаРождения = Формат(Запись.ДатаРождения,"ДФ=dd.MM");
	
	
	Текст = "";
	Тема  = "";
	
	ЕстьDNA = СтрНайти(Запись.КомментарийДляИТ, "DNA") > 0
		ИЛИ СтрНайти(Запись.ActualDepartmentName, "DNA") > 0; 
	Контур = ?(ЕстьDNA, "Green", Контур);
	
	Если Запись.Перевод  Тогда 
		
		Макет = РегистрыСведений.ZUPC_НовыеCотрудники.ПолучитьМакет("ХД_ПереводСотрудника_HTML");	
		
		ТекстHTML = Макет.ПолучитьТекст();
		
		СтрокаКолонок = "СотрудникСтрока,КомментарийДляИТ";
		
		мМассив  = СтрРазделить(СтрокаКолонок,",");
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", Запись[эл]); 	
			
		КонецЦикла;  		
		Тема = "1C ZUP: ("+Контур +") "+ Запись.Город + " internal transfer  " + Запись.СотрудникСтрока;     
		
	ИначеЕсли Запись.Увольнение  Тогда 
		
		Макет = РегистрыСведений.ZUPC_НовыеCотрудники.ПолучитьМакет("ХД_УвольнениеСотрудника_HTML");	
		
		ТекстHTML = Макет.ПолучитьТекст();
		
		СтрокаКолонок = "СотрудникСтрока,ЭлектроннаяПочта,ДатаУвольнения,КомментарийДляИТ,Офис,НомерМеста";
		
		мМассив  = СтрРазделить(СтрокаКолонок,",");
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", Запись[эл]); 	
			
		КонецЦикла;  		
		Тема = "1C ZUP: ("+Контур +") "+  Запись.Город +" resignation  " + Запись.СотрудникСтрока;
		
	ИначеЕсли Запись.ОтменаВыхода  Тогда 
		
		Макет = РегистрыСведений.ZUPC_НовыеCотрудники.ПолучитьМакет("ХД_ОтменаВыходаСотрудника_HTML");	
		
		ТекстHTML = Макет.ПолучитьТекст();
		
		СтрокаКолонок = "СотрудникСтрока,КомментарийДляИТ";
		
		мМассив  = СтрРазделить(СтрокаКолонок,",");
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", Запись[эл]); 	
			
		КонецЦикла;  		
		
		Тема = "1C ZUP: ("+Контур +") "+  Запись.Город +" cancel joining  " + Запись.СотрудникСтрока; 
		
	ИначеЕсли Запись.ОтменаУвольнения  Тогда 
		
		Макет = РегистрыСведений.ZUPC_НовыеCотрудники.ПолучитьМакет("ХД_ОтменаУвольнения_HTML");	
		
		ТекстHTML = Макет.ПолучитьТекст();
		
		СтрокаКолонок = "СотрудникСтрока,КомментарийДляИТ";
		
		мМассив  = СтрРазделить(СтрокаКолонок,",");
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", Запись[эл]); 	
			
		КонецЦикла;  
		Тема = "1C ZUP: ("+Контур +") "+ Запись.Город +" cancel termination  " + Запись.СотрудникСтрока;  
		
	ИначеЕсли Запись.Декрет  Тогда 
		
		Макет = РегистрыСведений.ZUPC_НовыеCотрудники.ПолучитьМакет("ХД_Декрет_HTML");	
		
		ТекстHTML = Макет.ПолучитьТекст();
		
		СтрокаКолонок = "СотрудникСтрока,КомментарийДляИТ";
		
		мМассив  = СтрРазделить(СтрокаКолонок,",");
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", Запись[эл]); 	
			
		КонецЦикла;  
		Тема = "1C ZUP: ("+Контур +") "+  Запись.Город +" Decree  " + Запись.СотрудникСтрока;
		
	Иначе     
		
		Макет = РегистрыСведений.ZUPC_НовыеCотрудники.ПолучитьМакет("ХД_ВыходСотрудника_HTML");	
		
		ТекстHTML = Макет.ПолучитьТекст();
		
		СтрокаКолонок = "СотрудникСтрока,Спеллинг,ЭлектроннаяПочта,ДатаВыхода,Офис,НомерМеста,СоздатьАккаунт,Пропуск,МобильныйТелефон,Руководитель,ActualPositionTitle,ActualDepartmentName,ОрганизоватьРабочееМесто,Юр_Лицо,Город,УдаленнаяРабота,КомментарийДляИТ,ДолжностьСтрокой";
		
		мМассив  = СтрРазделить(СтрокаКолонок,",");
		
		Для каждого эл Из мМассив Цикл
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "{"+эл+"}", Запись[эл]); 	
			
		КонецЦикла;  	
		
		ТекстHTML = СтрЗаменить(ТекстHTML, "{ДатаРождения}", ДатаРождения);
		
		Operations = ?(Запись.ActualDepartmentName.Наименование = "Operations", "OPS ", "");
		
		Тема = "1C ZUP: " + Operations + "("+Контур +") "+  Запись.Город +" new employee joining  " + Запись.СотрудникСтрока;
		
	КонецЕсли;
	
	Если Запись.Увольнение или Запись.ОтменаУвольнения Тогда 
		
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_УволенныйСотрудник", Истина);
		
	Иначе 
		
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_НовыхСотрудников", Истина);
		
	КонецЕсли;   
	
	Если ЕстьDNA Тогда
		Тема = СтрЗаменить(Тема, "ZUP:", "ZUP:DNA");
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
	ПараметрыПисьма.Вставить("Текст", ТекстHTML);
	ПараметрыПисьма.Вставить("ТекстHTML", ТекстHTML);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПисьма.Вставить("ПолучателиПисьма", ПолучателиПисьма);
	//ПараметрыПисьма.Вставить("ПолучателиКопий", ПолучателиКопий);
	//ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма);	
	
	Элементы.ДекорацияОтправлено.Подсказка = "Отправлено";
	Элементы.ДекорацияОтправлено.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
	
	ЗаписатьЗавершениеУведомления(Запись.СотрудникСтрока, ЭлектронноеПисьмоИсходящее);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДоменПочты =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("ДоменПочты", Истина)[0];

	UserLogonName = СокрЛП(Запись.FirstName) + "."+ СокрЛП(Запись.LastName);    
	Спеллинг = СокрЛП(Запись.FirstName) + " "+ СокрЛП(Запись.LastName);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦЗ_УчетнаяИнформацияПользователей.UserLogonName КАК UserLogonName
		|ИЗ
		|	РегистрСведений.ZUPC_УчетнаяИнформацияПользователей КАК ЦЗ_УчетнаяИнформацияПользователей
		|ГДЕ
		|	ЦЗ_УчетнаяИнформацияПользователей.UserLogonName = &UserLogonName";
	
	Запрос.УстановитьПараметр("UserLogonName", UserLogonName);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий()Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Имя "+ UserLogonName+ " занято!
		| Подберите другое имя!";
		Сообщение.Поле = "Запись.UserLogonName";
		Сообщение.УстановитьДанные(Запись);
		Сообщение.Сообщить();
	Иначе
		Если Не Запись.РучнойВводИмени  Тогда
		   	Если  СтрДлина(UserLogonName)>20 Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Длинна UserLogonName " + UserLogonName+ " была больше 20 символов, 
				|и поменялась по правилу FirstName +  первая буква LastName!";
				Сообщение.Поле = "Запись.UserLogonName";
				Сообщение.УстановитьДанные(Запись);
				Сообщение.Сообщить(); 
				UserLogonName = СокрЛП(Запись.FirstName) + "." + Лев(Запись.LastName, 1);
				
			КонецЕсли;
			Запись.UserLogonName  = UserLogonName;   
			Запись.Спеллинг       = Спеллинг;
			Запись.ЭлектроннаяПочта =  UserLogonName + ДоменПочты;
		Иначе
			Запись.ЭлектроннаяПочта =  UserLogonName + ДоменПочты;
		КонецЕсли;
		
	КонецЕсли;	
	
	Элементы.ДлиннаUserLogonName.Заголовок = "Длинна user logon name " + СтрДлина(Запись.UserLogonName) + "символов";
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусПользователяВРегистре(Почта, СотрудникСтрока, УИДН, ФизЛицо, Отключить)
	
	МЗ =   РегистрыСведений.ZUPC_УчетнаяИнформацияПользователей.СоздатьМенеджерЗаписи();
	МЗ.Почта =  Почта;
	МЗ.СотрудникСтрока = СотрудникСтрока;
	МЗ.Прочитать();   
	Если МЗ.Выбран() Тогда  
		МЗ.УникальныйИдентификатор =  УИДН;	
		МЗ.Отключить = Ложь;
		Если ЗначениеЗаполнено(ФизЛицо) Тогда
			МЗ.ФизическоеЛицо = ФизЛицо;	
		КонецЕсли;
		
	Конецесли;
	МЗ.Записать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолейАгентскойПрограммы()
	Элементы.ГруппаReferree.Видимость = Запись.SearchSource = ПредопределенноеЗначение("Перечисление.ZUPC_SearchSource.Referral");
	Элементы.ГруппаAgency.Видимость = Запись.SearchSource = ПредопределенноеЗначение("Перечисление.ZUPC_SearchSource.Agency");
КонецПроцедуры  

&НаКлиенте
Процедура ОчиститьПоляАгентскойПрограммы()
	Если Запись.SearchSource = ПредопределенноеЗначение("Перечисление.ZUPC_SearchSource.Referral") Тогда
		Запись.AgencyName = ПредопределенноеЗначение("Справочник.ZUPC_Agency.ПустаяСсылка");
		Запись.AgentFee = 0;
	ИначеЕсли Запись.SearchSource = ПредопределенноеЗначение("Перечисление.ZUPC_SearchSource.Agency") Тогда
		Запись.Referree = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");	
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ОтправитьвИТНаСервере()
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");
	
	Офис       =  Запись.Офис;
	Офис 	   =  ?(ЗначениеЗаполнено(Офис),Офис, "Нет");
	НомерМеста = Запись.НомерМеста;
	НомерМеста = ?(ЗначениеЗаполнено(НомерМеста),НомерМеста,"Нет");       
	ДатаВыхода = Формат(Запись.ДатаВыхода , "ДФ=dd.MM.yyyy");
	
	Текст = "";
	Тема  = "";
	
	Если Запись.Перевод  Тогда 
		
		Текст = Текст + СтрШаблон("Перевод  %1, комментарий для ИТ: %2"
		,Запись.СотрудникСтрока, Запись.КомментарийДляИТ);
		
		Тема = "ЗУП: Перевод сотрудника " + Запись.СотрудникСтрока;      
		
	ИначеЕсли Запись.Увольнение  Тогда 
		
		Текст = Текст + СтрШаблон("Увольнение  %1, дата увольнения: %2 комментарий для ИТ: %3"
		,Запись.СотрудникСтрока, Запись.ДатаУвольнения,Запись.КомментарийДляИТ);
		
		Тема = "ЗУП: Увольнение сотрудника " + Запись.СотрудникСтрока;
		
	ИначеЕсли Запись.ОтменаВыхода  Тогда 
		
		Текст = Текст + СтрШаблон("Отмена выхода  %1, комментарий для ИТ: %2"
		,Запись.СотрудникСтрока, Запись.КомментарийДляИТ);
		
		Тема = "ЗУП: Отмена выхода " + Запись.СотрудникСтрока; 
		
	ИначеЕсли Запись.ОтменаУвольнения  Тогда 
		
		Текст = Текст + СтрШаблон("Отмена увольнения  %1 комментарий для ИТ: %2"
		,Запись.СотрудникСтрока, Запись.КомментарийДляИТ);
		
		Тема = "ЗУП: Отмена увольнения сотрудника " + Запись.СотрудникСтрока;
		
	Иначе 
		
		Текст = Текст + СтрШаблон("Новый сотрудник %1, дата выхода %2,  офис %3, номер места %4,  
		|организовать рабочее место %5, создать аккаунт %6, пропуск %7, мобильный телефон %8,
		|руководитель %9, должность %10"
		,
		Запись.СотрудникСтрока, ДатаВыхода, Офис, НомерМеста,
		Запись.ОрганизоватьРабочееМесто,Запись.СоздатьАккаунт, Запись.Пропуск, Запись.МобильныйТелефон, 
		Запись.Руководитель, Запись.Должность);
		
		
		Текст = Текст + СтрШаблон(", отдел, %1, комментарий для ИТ: %2,
		|спеллинг: %3, организация: %4, город: %5, удаленная работа: %6",
		Запись.Отдел, Запись.КомментарийДляИТ, Запись.Спеллинг, Запись.Юр_Лицо, Запись.Город, Запись.УдаленнаяРабота); 
		
		Тема = "ЗУП: Выход нового сотрудника " + Запись.СотрудникСтрока;
		
	КонецЕсли;
	
	
	Если Запись.Увольнение  Тогда 
		
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_УволенныйСотрудник", Истина);
		
	Иначе 
		
		ПолучателиПисьма =  RSN_ОбщегоНазначенияПовтИсп.ЗначениеДополнительнойКонстанты("Рассылка_НовыхСотрудников", Истина);
		
	КонецЕсли;
	
	//УчетнаяЗапись 		= Неопределено;
	//ПолучателиПисьма    = Новый Массив;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Текст", Текст);
	//ПараметрыПисьма.Вставить("Важность", Важность);
	ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПисьма.Вставить("ПолучателиПисьма",ПолучателиПисьма);
	
	ЭлектронноеПисьмоИсходящее = УправлениеЭлектроннойПочтой.СоздатьИсходящееПисьмо(ПараметрыПисьма); 
	
	Элементы.ДекорацияОтправлено.Подсказка = "Отправлено";
	Элементы.ДекорацияОтправлено.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
	
	ЗаписатьЗавершениеУведомления(Запись.СотрудникСтрока, ЭлектронноеПисьмоИсходящее);	
	
КонецПроцедуры  


&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбработкаОповещенияНаСервере();
КонецПроцедуры
